package com.rectyle.govscheme;

import android.content.Intent;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;
import android.widget.TextView;
import android.widget.Toast;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.appcompat.app.AppCompatActivity;

public class Student extends AppCompatActivity {
    TextView txt_scheme,txt_discription;
    String गुणवान_विद्यार्थांना_आर्थिक_सहाय्य_कनिष्ठ_पातळी=" शालेय वशक्षण व क्रीडा ववभागामार्ण त राज्य शासन पुरस्कृ त आर्थिकदृष्टया मागासवगीय\n" +
            "ववद्यार्थ्यांसाठी शालाांत परीक्षोत्तर गुणवत्ता वशष्यवृत्ती योजना सन 1978-79 पासून राबववण्यात येते.\n" +
            "शासनाच्या सांदभाधीन अ.क्र.१ च्या वदनाांक 15 ऑक्टोबर, 199६ च्या शासन वनणणयानुसार सदर\n" +
            "वशष्यवृत्तीस पात्र होण्याकवरता माध्यवमक शालान्त पवरक्षेत (इ.१० वी) ववद्यार्थ्यांची गुण मयादा ५० टक्के\n" +
            "करण्यात आली आहे तसेच, योजनेचेवशष्यवृत्ती सांच ३२०० करण्यात आले आहेत. त्यानुसार एकू ण\n" +
            "३२०० मुलाांना वशष्यवृत्तीचा लाभ वदला जातो. पात्र ववद्यार्थ्यांमधून जास्तीत जास्त गुण असणाऱ्या\n" +
            "ववद्यार्थ्यांची वशष्यवृत्तीसाठी वनवड के ली जाते. या योजनेचा लाभ घेण्याकवरता पालकाांची वार्थिक उत्पन्न\n" +
            "मयादा रुपये 30000/- आहे. सद्यःस्स्ितीत सदर उत्पन्न मयादा खूप कमी असल्याने असांख्य ववद्यािी\n" +
            "वशष्यवृत्तीसाठी पात्र असूनही त्याांना वशष्यवृत्ती लाभापासून वांवचत रहावे लागते त्यामुळे योजनेचे उविष्ट\n" +
            "साध्य होत नाही.\n" +
            "उच्च व तांत्र वशक्षण ववभागाच्या वद. ३१ माचण, २०१८ च्या शासन वनणणयान्वये आर्थिकदृष्टया\n" +
            "दुबणल घटकातील ववद्यार्थ्यांना राजिी छत्रपती शाहू महाराज वशक्षण शुल्क वशष्यवृत्ती योजनेचा लाभ\n" +
            "देण्यासाठी ववद्यार्थ्यांच्या पालकाांची वार्थिक उत्पन्न मयादा रु.६ लाखावरुन रु.८ लाख इतकी करण्यात\n" +
            "आली आहे. त्याच धतीवर प्रस्तुत योजनेची पालकाांची वार्थिक उत्पन्न मयादा वाढववण्याची बाब\n" +
            "शासनाच्या ववचाराधीन होती त्यानुिांगाने पुढीलप्रमाणे वनणणय घेण्यात येत आहे. ";
    String गुणवान_िद्यार्थांना_आर्थिक_सहाय्य_वरिष्ठ_पातळी="वाचा क्र. १ येिे नमूद जद. 30 नोव्हेंबर 2018 रोिीच्या अजिजनयमाद्वारे सामाजिक व\n" +
            "शैक्षजणकदृष्या मागास प्रवगष नव्याने घोजर्षत करण्यात आला असून त्यामध्ये मराठा समािाचा समावेश\n" +
            "करण्यात आला आहे.\n" +
            "वाचा क्र.२ येिे नमूद सन 2019 चा अजिजनयम क्र. 7 जद. 3 िुलै, 2019 अन्वये वाचा\n" +
            "क्र. १ येिे नमूद अजिजनयमातील कलम 4 क येिे सामाजिक व शैक्षजणकदृष्या मागास प्रवगासाठी\n" +
            "जवजनर्थदष्ट आरक्षण 12 % तर कलम 4 ख येिे जवजनर्थदष्ट आरक्षण 13 % एवढे जवजहत करण्यात आले\n" +
            "आहे.\n" +
            " वाचा क्र. ३ येिे नमूद सामाजिक न्याय व जवशेर्ष सहाय्य जवभागाच्या जद. 25 िुन 2019\n" +
            "रोिीच्या शासन जनणषयान्वये मराठा आरक्षण तसेच सामाजिक व शैक्षजणकदृष्या मागासप्रवगष कल्याण\n" +
            "हे जवर्षय जविाभि, इमाव व जवमाप्र कल्याण जवभागास हस्तांतरीत करण्यात आले आहेत.\n" +
            "मा. मंत्री महसुल तिा अध्यक्ष मंजत्रमंडउ सपसजमती यांच्या अध्यक्षतेखाली सामाजिक व\n" +
            "शैक्षजणकदृष्या मागासप्रवगातील जवद्यार्थ्याना सन 2019-20 या शैक्षजणक वर्षापासून रािर्षी छत्रपती\n" +
            "शाहू महाराि जशक्षण शुल्क जशष्यवृत्ती योिना तसेच डॉ. पंिाबराव देशमुख वसजतगृह जनवाह भत्ता\n" +
            "जवस्तारीत योिना लागू करणेबाबत जद. 26.6.2019 रोिी दुपारी 3.00 वािता जविानभवन, मुंबई येिे\n" +
            "बैठक संपन्न झाली. सदर बैठकीत झालेल्या जनणषयानुसार सदर योिना सामाजिक व शैक्षजणकदृष्या\n" +
            "\n" +
            "मागासप्रवगातील जवद्यार्थ्याना सन 2019-20 या शैक्षजणक वर्षापासून लागू करण्याची बाब शासनाच्या\n" +
            "जवचारािीन होती. तद्नुर्षंगाने खालीलप्रमाणे शासनजनणषय जनगषजमत करण्यात येत आहे.\n" +
            "\n";
    String गणित_व_भौतिकशास्त्र_विषयातील_प्रज्ञावान_विद्यार्थांना_देण्यात_येणारी_शिष्यवृत्ती="र्ुणवान व होतकरू शवद्यार्थ्यांसाठी िाज्य िासनाकडून देण्यात येणाऱ्या काही\n" +
            "शिष्यवृत्ती/आर्थिक सहाय्य योजना उच्च शिक्षण संचालनालयामार्ग त िाबशवण्यात येतात.\n" +
            "2. संदभाशधन क्र. 1 येिील महािाष्र आधाि (शवत्तीय व इति अिग सहाय्य, लाभ आशण सेवा\n" +
            "यांचे लशययत शवतिण) अशधशनयम, 2016 मध्ये िासनाकडून देण्यात येणािे कोणतेही आर्थिक\n" +
            "सहाय्य, लाभ व सेवांच्या प्रयोजनांिग संबंशधत लाभार्थ्यांचे अशधप्रमाणन ककवा पुिावा म्हणून\n" +
            "आधाि क्रमांक प्राप्त करून त्यांच्या आधाि संलग्ननत बॅंक खात्यात शवत्तीय लाभाची िक्कम िेट\n" +
            "जमा किण्याची तितूद के ली आहे. सदि अशधशनयमातील कलम 3 व 4 मधील तितुदीनुसाि\n" +
            "संदभाधीन क्र.2 येिील अशधसूचनेन्वये उच्च शिक्षण संचालनालयामार्ग त शवद्यार्थ्यांना िाज्य\n" +
            "िासनाकडून देण्यात येणािी शिष्यवृत्ती/आर्थिक सहाय्य योजनांची सूची व सदि योजनेचा लाभ\n" +
            "शमळण्यासाठी ओळख शसद्ध किण्याच्या प्रयोजनािग ओळखीचे अशधप्रमाणन ककवा पुिावा\n" +
            "अशधसूचीत के ले आहेत. त्यानुसाि अशधसूचीत के लेल्या शिष्यवृत्ती/आर्थिक सहाय्य योजनांचा\n" +
            "लाभ देण्याच्या प्रयोजनािग संबंशधत लाभार्थ्यांचे अशधप्रमाणन ककवा पुिावा म्हणून आधाि क्रमांक\n" +
            "प्राप्त करून, त्यांच्या आधाि संलग्ननत बॅंक खात्यात शवत्तीय लाभाची िक्कम िेट जमा\n" +
            "किण्याची बाब िासनाच्या शवचािाधीन होती.\n" +
            "3. तिी संदभाधीन क्रमांक 2 येिील अशधसूचनेमध्ये अशधसूशचत के लेल्या शिष्यवृत्ती/\n" +
            "आर्थिक सहाय्य योजनेंतर्गत पात्र लाभािी शवद्यार्थ्यांना देण्यात येणािी लाभाची िक्कम ही िेट\n" +
            "लाभार्थ्यांस त्यांच्या आधाि संलग्ननत बॅंक खात्यात िासनाकडून जमा किण्यासाठी\n" +
            "पुढीलप्रमाणे शनदेि देण्यात येत आह";
    String वैद्यकीय_व_दंत_महाविद्यालयातील_एसईबीसी_आणि_ईडब्ल्युएस_आरक्षणामुळे_बाधित_खुल्या_प्रवर्गातील_विद्यार्थ्यांची_शिक्षण_शुल्काची_प्रतिपुर्ती="राज्यातील “सामाणजक व िैक्षणणकदृष्ट्या मागास (SEBC) वगाकरीता” राज्यातील िैक्षणणक\n" +
            "संसथांमधील प्रवेिासाठी आणण राज्याच्या णनयंत्रणाखालील लोकसेवांमधील णनयुक्तयांमध्ये संदभाधीन\n" +
            "अणधणनयम/ अध्यादेि याद्वारेआरक्षण णवहीत करण्यात आले आहे. तयानुषंगाने, संदभाधीन क्रमांक 2 वरील\n" +
            "पत्रान्वये सदर आरक्षण आरोग्य णवज्ञान अभ्यासक्रमांच्या प्रवेिांकरीता लागूकरण्यात आले आहे.\n" +
            "2. राज्यातील खु्या प्रवगातील आर्थथकदृष्ट्या दुबणल घिकातील (EWS) णवद्यार्थ्यांना (अ्पसंखयांक\n" +
            "दजाप्राप्त िैक्षणणक संसथा वगळून) िैक्षणणक संसथा/ अनुदाणनत णवद्यालये, महाणवद्यालये, सवण उच्च णिक्षण\n" +
            "देणाऱ्या संसथा यामध्ये एकु ण प्रवेि द्यावयाच्या जागांमध्ये 10 िक्के आरक्षण सामान्य प्रिासन णवभागाच्या\n" +
            "संदभाधीन क्रमांक 4 वरील िासन णनणणयान्वये लागूकरण्यात आले आहे. तयास अनुसरुन संदभाधीन क्रमांक 3\n" +
            "वरील िासन णनणणयान्वये आर्थथकदृष्ट्या दुबणल घिकांसाठी राज्यातील आरोग्य णवज्ञानाच्या िासकीमहापाणलका/ िासन अनुदाणनत/ खाजगी णवना अनुदाणनत महाणवद्यालये (अ्पसंखयांक िैक्षणणक संसथा वगळून)\n" +
            "यामध्ये प्रवेि द्यावयाच्या जागांमध्ये 10 िक्के आरक्षण णवहीत करण्यात आले आहे.\n" +
            "3. सन 2019-20 या िैक्षणणक वषी उक्त एसईबीसी आणण ईडब्ल्युएस आरक्षण लागूके ्यामुळे खु्या\n" +
            "प्रवगातील काही गुणवत्ताधारक णवद्यार्थ्यांचे वैद्यकीय व दंत अभ्यासक्रमाचे प्रवेि बाणधत होऊन तयांना िासकीय\n" +
            "महाणवद्यालयाऐवजी खाजगी णवनाअनुदाणनत महाणवद्यालयात प्रवेि घ्यावे लागले होते. सन 2019-20 या\n" +
            "िैक्षणणक वषी अिा बाधीत झाले्या वैद्यकीय व दंत अभ्यासक्रमांच्या खु्या प्रवगातील णवद्यार्थ्यांना तयांच्या\n" +
            "संबंणधत अभ्यासक्रमाचे िैक्षणणक िु्काचा िासनामार्ण त भरणा करण्यास “एक णविेष बाब” व “र्क्त\n" +
            "एकवेळेचीच बाब” म्हणून संदभाधीन िासनणनणणय क्रमांक 1 अन्वये ततवत: मान्यता देण्यात आली होती. सदर\n" +
            "िासन णनणणयास णदनांक 12/08/2020 रोजी झाले्या मंणत्रमंडळाच्या बैठकीत कायोत्तर मान्यता देण्यात आली\n" +
            "आहे. तयानुषंगाने, तसेच उपरोक्त बाणधत णवद्यार्थ्यांना करावयाची िैक्षणणक िु्काची प्रणतपुती यासंदभात\n" +
            "पात्रतेसाठीचे णनकष व कायणपध्दती याबाबत सवतंत्रपणे सूचना णनगणणमत करण्याची बाब िासनाच्या णवचाराणधन\n" +
            "होती";
    String राज्य_शासनाची_खुली_गुणवत्ता_शिष्यवृत्ती="र्ुणवान व होतकरू शवद्यार्थ्यांसाठी िाज्य िासनाकडून देण्यात येणाऱ्या काही\n" +
            "शिष्यवृत्ती/आर्थिक सहाय्य योजना उच्च शिक्षण संचालनालयामार्ग त िाबशवण्यात येतात.\n" +
            "2. संदभाशधन क्र. 1 येिील महािाष्र आधाि (शवत्तीय व इति अिग सहाय्य, लाभ आशण सेवा\n" +
            "यांचे लशययत शवतिण) अशधशनयम, 2016 मध्ये िासनाकडून देण्यात येणािे कोणतेही आर्थिक\n" +
            "सहाय्य, लाभ व सेवांच्या प्रयोजनांिग संबंशधत लाभार्थ्यांचे अशधप्रमाणन ककवा पुिावा म्हणून\n" +
            "आधाि क्रमांक प्राप्त करून त्यांच्या आधाि संलग्ननत बॅंक खात्यात शवत्तीय लाभाची िक्कम िेट\n" +
            "जमा किण्याची तितूद के ली आहे. सदि अशधशनयमातील कलम 3 व 4 मधील तितुदीनुसाि\n" +
            "संदभाधीन क्र.2 येिील अशधसूचनेन्वये उच्च शिक्षण संचालनालयामार्ग त शवद्यार्थ्यांना िाज्य\n" +
            "िासनाकडून देण्यात येणािी शिष्यवृत्ती/आर्थिक सहाय्य योजनांची सूची व सदि योजनेचा लाभ\n" +
            "शमळण्यासाठी ओळख शसद्ध किण्याच्या प्रयोजनािग ओळखीचे अशधप्रमाणन ककवा पुिावा\n" +
            "अशधसूचीत के ले आहेत. त्यानुसाि अशधसूचीत के लेल्या शिष्यवृत्ती/आर्थिक सहाय्य योजनांचा\n" +
            "लाभ देण्याच्या प्रयोजनािग संबंशधत लाभार्थ्यांचे अशधप्रमाणन ककवा पुिावा म्हणून आधाि क्रमांक\n" +
            "प्राप्त करून, त्यांच्या आधाि संलग्ननत बॅंक खात्यात शवत्तीय लाभाची िक्कम िेट जमा\n" +
            "किण्याची बाब िासनाच्या शवचािाधीन होती.\n" +
            "3. तिी संदभाधीन क्रमांक 2 येिील अशधसूचनेमध्ये अशधसूशचत के लेल्या शिष्यवृत्ती/\n" +
            "आर्थिक सहाय्य योजनेंतर्गत पात्र लाभािी शवद्यार्थ्यांना देण्यात येणािी लाभाची िक्कम ही िेट\n" +
            "लाभार्थ्यांस त्यांच्या आधाि संलग्ननत बॅंक खात्यात िासनाकडून जमा किण्यासाठी\n" +
            "पुढीलप्रमाणे शनदेि देण्यात येत आह";
    String मागासवर्गीय_विद्यार्थ्यांसाठी_शिक्षण_शुल्क_आणि_परीक्षा_शुल्क="शासनाच्या उच्ि ि तंत्र वशक्षण विभाग, िैद्यकीय वशक्षण ि औषधी द्रव्ये विभाग, कृ वष विभाग,\n" +
            "पशुसंिधगन, दुग्धव्यिसाय आवण मत्ससयव्यिसाय विभाग या विभागांच्या अवधपत्सयाखालील मान्यता प्राप्त\n" +
            "खाजगी विनाअनुदावनत ि कायम विनाअनुदावनत संस्ांमध्ये प्रिेश घेणाऱ्या विद्यार्थ्याना शैक्षवणक शुल्क\n" +
            "प्रवतपूती करण्याबाबतिा धोरणात्समक वनणगय शैक्षवणक िषग 2006-07 पासून घेतलेला आहे. सदरहू\n" +
            "वनणगय शैक्षवणक िषग2007-08, 2008-09, 2009-10, 2010-11, 2011-12, 2012-13, 2013-14\n" +
            "ि 2014-15 मध्ये कायम ठेिण्यात आलेला आहे. सदरहूयोजना शैक्षवणक िषग 2015-16 पासून सुरु\n" +
            "ठेिण्याबाबतच्या उच्ि ि तंत्र वशक्षण विभागाच्या प्रसतािास मा.मंवत्रमंडळाच्या बैठकीत मान्यता घेण्यात\n" +
            "आली असून त्सयासंदभातील उच्ि ि तंत्रवशक्षण विभागाच्या वदनांक 31 मािग, 2016 च्या शासन\n" +
            "वनणगयाच्या अनुषंगाने अनुसूवित जाती, विमुक्त जाती, भटक्या जमाती, इतर मागास िगग ि विशेष\n" +
            "मागास प्रिगातील विद्यार्थ्यांना शैक्षवणक शुल्क प्रवतपूती करण्यािा प्रसताि शासनाच्या वििाराधीन\n" +
            "होता. त्सयानुसार शासनाने पुढीलप्रमाणे वनणगय घेतला आहे.\n" +
            "\n" +
            "शासन वनणगय :\n" +
            "राज्यातील शासवकय, अशासवकय अनुदावनत ि विनाअनुदावनत महाविद्यालये/तंत्रवनके तने\n" +
            "आवण शासवकय विद्यापीठात विनाअनुदावनत तत्सिािर सुरु असलेल्या वनिडक व्यािसावयक\n" +
            "अभ्यासक्रमांसाठी प्रिेश घेतलेल्या अनुसूवित जाती, विमुक्त जाती, भटक्या जमाती, विशेष मागास\n" +
            "प्रिगग ि इतर मागास प्रिगातील विद्यार्थ्यांसाठी शैक्षवणक शुल्क प्रवतपूती योजना शैक्षवणक िषग 2015-\n" +
            "16 पासून पुढे सुरु ठेिण्यास खालीलप्रमाणे शासनािी मान्यता देण्यात येत आहे:-\n" +
            "1. प्रिवलत वशक्षण शुल्क प्रवतपूती योजना शैक्षवणक िषग 2015-16 पासून पुढे अंमलबजािणी\n" +
            "करण्यात यािी.\n" +
            "2. सदर योजनेच्या अंमलबजािणीस दरिषी मंवत्रमंडळािी मान्यता न घेता धोरण म्हणून सदर\n" +
            "योजनेस मान्यता देण्यात यािी.";

    @Override
    protected void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_result);
        txt_scheme=findViewById(R.id.txt_scheme);
        txt_discription=findViewById(R.id.txt_description);
        Intent result=getIntent();
        String temp=result.getStringExtra("data");
        txt_scheme.setText(temp);

        switch (temp){

            case "गुणवान विद्यार्थांना आर्थिक सहाय्य - कनिष्ठ पातळी":txt_discription.setText(गुणवान_विद्यार्थांना_आर्थिक_सहाय्य_कनिष्ठ_पातळी);
                break;
            case "गुणवान विद्यार्थांना आर्थिक सहाय्य - वरिष्ठ पातळी":txt_discription.setText(गुणवान_िद्यार्थांना_आर्थिक_सहाय्य_वरिष्ठ_पातळी);
                break;
            case "गणित व भौतिकशास्त्र विषयातील प्रज्ञावान विद्यार्थांना देण्यात येणारी शिष्यवृत्ती":txt_discription.setText(गणित_व_भौतिकशास्त्र_विषयातील_प्रज्ञावान_विद्यार्थांना_देण्यात_येणारी_शिष्यवृत्ती);
                break;
            case "वैद्यकीय व दंत महाविद्यालयातील एसईबीसी आणि ईडब्ल्युएस आरक्षणामुळे बाधित खुल्या प्रवर्गातील विद्यार्थ्यांची शिक्षण शुल्काची प्रतिपुर्ती":txt_discription.setText(वैद्यकीय_व_दंत_महाविद्यालयातील_एसईबीसी_आणि_ईडब्ल्युएस_आरक्षणामुळे_बाधित_खुल्या_प्रवर्गातील_विद्यार्थ्यांची_शिक्षण_शुल्काची_प्रतिपुर्ती);
                break;
            case "राज्य शासनाची खुली गुणवत्ता शिष्यवृत्ती":txt_discription.setText(राज्य_शासनाची_खुली_गुणवत्ता_शिष्यवृत्ती);
                break;
            case "मागासवर्गीय विद्यार्थ्यांसाठी शिक्षण शुल्क आणि परीक्षा शुल्क":txt_discription.setText(मागासवर्गीय_विद्यार्थ्यांसाठी_शिक्षण_शुल्क_आणि_परीक्षा_शुल्क);
                break;
            default:
                Toast.makeText(getApplicationContext(), "select any option", Toast.LENGTH_SHORT).show();
        }
    }

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        MenuInflater inflater = getMenuInflater();
        inflater.inflate(R.menu.main_menu,menu);

        return true;
    }

    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        int id=item.getItemId();
        if(id==R.id.menu_home){
            Intent home = new Intent(getApplicationContext(),MainActivity.class);
            startActivity(home);
        }
        if (id==R.id.menu_notification){
            Intent notify=new Intent(getApplicationContext(),GetNotification.class);
            startActivity(notify);
        }
        if (id==R.id.menu_farmer){
            Intent tempIntent1= new Intent(getApplicationContext(),Farmers.class);
            tempIntent1.putExtra("choice","Farmers");
            startActivity(tempIntent1);
        }
        if(id==R.id.menu_women){
            Intent tempIntent2= new Intent(getApplicationContext(),Farmers.class);
            tempIntent2.putExtra("choice","Women");
            startActivity(tempIntent2);
        }
        if (id==R.id.menu_labour){
            Intent tempIntent3= new Intent(getApplicationContext(),Farmers.class);
            tempIntent3.putExtra("choice","Labours");
            startActivity(tempIntent3);
        }

        if (id==R.id.menu_startup){
            Intent tempIntent4= new Intent(getApplicationContext(),Farmers.class);
            tempIntent4.putExtra("choice","Startups");
            startActivity(tempIntent4);

        }
        if(id==R.id.menu_student){
            Intent tempIntent5= new Intent(getApplicationContext(),Farmers.class);
            tempIntent5.putExtra("choice","Students");
            startActivity(tempIntent5);
        }
        if(id==R.id.share){
            try {
                Intent intent = new Intent(Intent.ACTION_SEND);
                intent.setType("text/plain");
                intent.putExtra(Intent.EXTRA_SUBJECT,"share app");
                String putMessage="https://www.govscheme.com  "+BuildConfig.APPLICATION_ID+"\n\n";
                intent.putExtra(Intent.EXTRA_TEXT,putMessage);
                startActivity(Intent.createChooser(intent,"share by"));
            }catch (Exception e){
                Toast.makeText(this,"Error occurred",Toast.LENGTH_SHORT).show();
            }
        }
        return super.onOptionsItemSelected(item);
    }
}
